app/controllers/bears_controller.rb

  def index
    @bears = Bear.all
---
SELECT "bears".* FROM "bears"

  def create
    @bear = Bear.new(bear_params)
    if @bear.save
---
INSERT INTO "bears" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Pacha"], ["description", "Bang Bang this bear is a bear!"], ["created_at", "2016-02-01 16:45:07.265853"], ["updated_at", "2016-02-01 16:45:07.265853"]]

  def update
    if @bear.update(bear_params)
---
UPDATE "bears" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "bears"."id" = ?  [["name", "Pacha!"], ["description", "THIS BEAR HUH"], ["updated_at", "2016-02-01 16:49:35.857119"], ["id", 2]]

  def destroy
    if @bear.destroy
---
DELETE FROM "bears" WHERE "bears"."id" = ?  [["id", 1]]

  def set_bear
    @bear = Bear.find(params[:id])
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 2]]